afatom/arm-cortex-m4-programming/arm/cortex-m4/stm32f407/stm32f4xx_drivers_dev/Inc/hal_stm32f407xx.h
/*
 * stm32f407xx.h
 *
 *  Created on: Feb 14, 2021
 *      Author: fares.adham@gmail.com
 */

#ifndef INC_HAL_STM32F407XX_H_
#define INC_HAL_STM32F407XX_H_


#include <stdint.h>

typedef uint8_t   u8;
typedef uint16_t  u16;
typedef uint32_t  u32;
typedef uint64_t  u64;

typedef u64   U64;
typedef u32   U32;
typedef u16   U16;
typedef u8    U8;


typedef volatile uint32_t _vou32;
typedef volatile uint64_t _vou64;
typedef volatile uint16_t _vou16;
typedef volatile uint8_t  _vou8;



#define HAL_ENABLE                     (1)
#define HAL_DISABLE                    (0)
#define HAL_CLK_ENABLE   (HAL_ENABLE)
#define HAL_CLK_DISABLE   (HAL_DISABLE)
#define HAL_SET              (HAL_ENABLE)
#define HAL_CLEAR            (HAL_DISABLE)
#define HAL_RESET            (HAL_DISABLE)
#define HAL_HIGH             (HAL_ENABLE)
#define HAL_LOW              (HAL_CLEAR)


#define BIT_0        (0 )
#define BIT_1        (1 )
#define BIT_2        (2 )
#define BIT_3        (3 )
#define BIT_4        (4 )
#define BIT_5        (5 )
#define BIT_6        (6 )
#define BIT_7        (7 )
#define BIT_8        (8 )
#define BIT_9        (9 )
#define BIT_10       (10)
#define BIT_11       (11)
#define BIT_12       (12)
#define BIT_13       (13)
#define BIT_14       (14)
#define BIT_15       (15)
#define BIT_16       (16)
#define BIT_17       (17)
#define BIT_18       (18)
#define BIT_19       (19)
#define BIT_20       (20)
#define BIT_21       (21)
#define BIT_22       (22)
#define BIT_23       (23)
#define BIT_24       (24)
#define BIT_25       (25)
#define BIT_26       (26)
#define BIT_27       (27)
#define BIT_28       (28)
#define BIT_29       (29)
#define BIT_30       (30)
#define BIT_31       (31)


/*********************************************************************
 *          GPIO Ports Names/IDs
 *********************************************************************/
#define GPIO_PORT_A_ID                      (0)
#define GPIO_PORT_B_ID                      (1)
#define GPIO_PORT_C_ID                      (2)
#define GPIO_PORT_D_ID                      (3)
#define GPIO_PORT_E_ID                      (4)
#define GPIO_PORT_F_ID                      (5)
#define GPIO_PORT_G_ID                      (6)
#define GPIO_PORT_H_ID                      (7)
#define GPIO_PORT_I_ID                      (8)
#define GPIO_PORT_J_ID                      (9)
#define GPIO_PORT_K_ID                      (10)






#define HAL_MACRO_TOGGLE_REG_BIT(reg, bit)      ((*reg) ^= (1 << bit))
#define HAL_MACRO_TON_REG_BIT(reg, bit)         ((*reg) |= (1 << bit))
#define HAL_MACRO_TOFF_REG_BIT(reg, bit)        ((*reg) &= ~(1 << bit))


/*0x0 is wrong i need to change it later*/
#define HAL_INVALID_RAM_ADDRESS                 ((U32*)0x0)
#define nullptr                                 (HAL_INVALID_RAM_ADDRESS)

//#define WRITE_REGISTER(_REG_, _VAL_)

/* Memory definitions taken from Table 5. Flash module organization (STM32F40x and STM32F41x) RM75 */

#define HAL_FLASH_BASE_ADDRESS                (0x08000000U)               /* Main memory area */
#define HAL_FLASH_LENGTH                      (0x100000U)                 /* flash length in bytes, 1 MB total length */
#define HAL_FLASH_16KB_SECTOR_LENGTH          (0x4000U)                   /* small flash sector length is  16  KB*/
#define HAL_FLASH_64KB_SECTOR_LENGTH          (0x10000U)                  /* med flash sector length is    64  KB*/
#define HAL_FLASH_128KB_SECTOR_LENGTH         (0x20000U)                   /* large flash sector length is  128 KB*/

/* flashHAL_ can be separated and behaved as sectors below */
#define HAL_FLASH_SECTOR_0_BASE_ADDRESS       (HAL_FLASH_BASE_ADDRESS)                                                 /* 16KB flash Sector  */
#define HAL_FLASH_SECTOR_1_BASE_ADDRESS       (HAL_FLASH_SECTOR_0_BASE_ADDRESS +  HAL_FLASH_16KB_SECTOR_LENGTH)             /* 16KB flash Sector  */
#define HAL_FLASH_SECTOR_2_BASE_ADDRESS       (HAL_FLASH_SECTOR_1_BASE_ADDRESS +  HAL_FLASH_16KB_SECTOR_LENGTH)             /* 16KB flash Sector  */
#define HAL_FLASH_SECTOR_3_BASE_ADDRESS       (HAL_FLASH_SECTOR_2_BASE_ADDRESS +  HAL_FLASH_16KB_SECTOR_LENGTH)             /* 16KB flash Sector  */
#define HAL_FLASH_SECTOR_4_BASE_ADDRESS       (HAL_FLASH_SECTOR_3_BASE_ADDRESS +  HAL_FLASH_16KB_SECTOR_LENGTH)             /* 64KB flash Sector  */
#define HAL_FLASH_SECTOR_5_BASE_ADDRESS       (HAL_FLASH_SECTOR_4_BASE_ADDRESS +  HAL_FLASH_64KB_SECTOR_LENGTH)             /* 128KB flash Sector */
#define HAL_FLASH_SECTOR_6_BASE_ADDRESS       (HAL_FLASH_SECTOR_5_BASE_ADDRESS +  HAL_FLASH_128KB_SECTOR_LENGTH)            /* 128KB flash Sector */
#define HAL_FLASH_SECTOR_7_BASE_ADDRESS       (HAL_FLASH_SECTOR_6_BASE_ADDRESS +  HAL_FLASH_128KB_SECTOR_LENGTH)            /* 128KB flash Sector */
#define HAL_FLASH_SECTOR_8_BASE_ADDRESS       (HAL_FLASH_SECTOR_7_BASE_ADDRESS +  HAL_FLASH_128KB_SECTOR_LENGTH)            /* 128KB flash Sector */
#define HAL_FLASH_SECTOR_9_BASE_ADDRESS       (HAL_FLASH_SECTOR_8_BASE_ADDRESS +  HAL_FLASH_128KB_SECTOR_LENGTH)            /* 128KB flash Sector */
#define HAL_FLASH_SECTOR_10_BASE_ADDRESS      (HAL_FLASH_SECTOR_9_BASE_ADDRESS +  HAL_FLASH_128KB_SECTOR_LENGTH)            /* 128KB flash Sector */
#define HAL_FLASH_SECTOR_11_BASE_ADDRESS      (HAL_FLASH_SECTOR_10_BASE_ADDRESS + HAL_FLASH_128KB_SECTOR_LENGTH)           /* 128KB flash Sector */

#define HAL_SYSTEM_MEM_BASE_ADDRESS           (0x1FFF0000U) //ROM Area
#define HAL_SYSTEM_MEM_LENGTH                 (0x7800U)   /* 30KB length */
#define HAL_ROM_BASE_ADDRESS                  (HAL_SYSTEM_MEM_BASE_ADDRESS)
#define HAL_ROM_LENGTH                        (HAL_SYSTEM_MEM_LENGTH)
#define HAL_OTP_BASE_ADDRESS                  (0x1FFF7800U)
#define HAL_OTP_LENGTH                        (0x210U)  /*512Bytes*/
#define HAL_OPTION_BYTES_BASE_ADDRESS         (0x1FFFC000U)
#define HAL_OPTION_BYTES_LENGTH               (0x10U) /*16bytes*/
#define HAL_SRAM1_BASE_ADDRESS                (0x20000000U)
#define HAL_SRAM1_LENGTH                      (0x1C000U)                  /* 112KB */
#define HAL_SRAM2_BASE_ADDRESS                (0x2001C000U)               /* (SRAM1_BASE_ADDRESS + SRAM1_LENGTH) */
#define HAL_SRAM2_LENGTH                      (0x4000)                   /* 16KB */
#define HAL_SRAM                              (HAL_SRAM1_BASE_ADDRESS)

