afatom/arm-cortex-m4-programming/arm/cortex-m4/stm32f407/stm32f4xx_drivers_dev/Inc/hal_stm32f407xx.h
/* Base addresses of various bus domains e.g. AHBx APBx
 * 2 AHB bus domain and 2 APB bus domains. AHB bus is used for those peripherals which need high speed data communication
 * e.g. camera and gpios. where APB bus is used for those peripherals which low speed communication would suffice
 * below is figure of the whole memory map of STM32F407 MCU
 * *-------------------------------------*------------------------------------------------------*
 * |                                     |                                                      |
 * |                                     |  memory mapped register and peripheral registers     |
 * *-------------------------------------*------------------------------------------------------*
 * 0x0                                   0x4000_000                                             0xFFFF_FFFF
 * */

#define HAL_PERIPHERALS_BASE_ADDRESS          (0x40000000U)
#define HAL_APB1_BUS_PERIPH_BASE_ADDRESS      (HAL_PERIPHERALS_BASE_ADDRESS)
#define HAL_APB2_BUS_PERIPH_BASE_ADDRESS      (0x40010000U)
#define HAL_AHB1_BUS_PERIPH_BASE_ADDRESS      (0x40020000U)
#define HAL_AHB2_BUS_PERIPH_BASE_ADDRESS      (0x50000000U)
/*definitions of various peripherals that hanging out on the buses above and in details:
 * AHB1 Peripherals: GPIOA...GPIOI
 * APB1 Peripherals:*/
                                          	  	  /*bus base address +             offset */
#define HAL_GPIO_A_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x0000)
#define HAL_GPIO_B_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x0400)
#define HAL_GPIO_C_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x0800)
#define HAL_GPIO_D_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x0C00)
#define HAL_GPIO_E_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x1000)
#define HAL_GPIO_F_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x1400)
#define HAL_GPIO_G_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x1800)
#define HAL_GPIO_H_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x1C00)
#define HAL_GPIO_I_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x2000)
#define HAL_GPIO_J_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x2400)
#define HAL_GPIO_K_BASE_ADDRESS                (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS  + 0x2800)


//APB1HAL_
#define HAL_SPI_2_BASE_ADDRESS                 (HAL_APB1_BUS_PERIPH_BASE_ADDRESS + 0x3800)
#define HAL_SPI_3_BASE_ADDRESS                 (HAL_APB1_BUS_PERIPH_BASE_ADDRESS + 0x3C00)

#define HAL_USART_2_BASE_ADDRESS               (HAL_APB1_BUS_PERIPH_BASE_ADDRESS + 0x4400)
#define HAL_USART_3_BASE_ADDRESS               (HAL_APB1_BUS_PERIPH_BASE_ADDRESS + 0x4800)
#define HAL_UART_4_BASE_ADDRESS                (HAL_APB1_BUS_PERIPH_BASE_ADDRESS  + 0x4C00)
#define HAL_UART_5_BASE_ADDRESS                (HAL_APB1_BUS_PERIPH_BASE_ADDRESS  + 0x5000)
#define HAL_UART_7_BASE_ADDRESS                (HAL_APB1_BUS_PERIPH_BASE_ADDRESS  + 0x7800)
#define HAL_UART_8_BASE_ADDRESS                (HAL_APB1_BUS_PERIPH_BASE_ADDRESS  + 0x7C00)
#define HAL_I2C_1_BASE_ADDRESS                 (HAL_APB1_BUS_PERIPH_BASE_ADDRESS  + 0x5400)
#define HAL_I2C_2_BASE_ADDRESS                 (HAL_APB1_BUS_PERIPH_BASE_ADDRESS  + 0x5800)
#define HAL_I2C_3_BASE_ADDRESS                 (HAL_APB1_BUS_PERIPH_BASE_ADDRESS  + 0x5C00)

//APB2
#define HAL_USART_1_BASE_ADDRESS               (HAL_APB2_BUS_PERIPH_BASE_ADDRESS + 0x1000)
#define HAL_USART_6_BASE_ADDRESS               (HAL_APB2_BUS_PERIPH_BASE_ADDRESS + 0x1400)

#define HAL_SPI_1_BASE_ADDRESS                 (HAL_APB2_BUS_PERIPH_BASE_ADDRESS + 0x3000)
#define HAL_SPI_4_BASE_ADDRESS                 (HAL_APB2_BUS_PERIPH_BASE_ADDRESS + 0x3400)

#define HAL_SYSCFG_BASE_ADDRESS                (HAL_APB2_BUS_PERIPH_BASE_ADDRESS + 0x3800)
#define HAL_EXTI_BASE_ADDRESS                  (HAL_APB2_BUS_PERIPH_BASE_ADDRESS + 0x3C00)
#define HAL_SPI_5_BASE_ADDRESS                 (HAL_APB2_BUS_PERIPH_BASE_ADDRESS + 0x5000)
#define HAL_SPI_6_BASE_ADDRESS                 (HAL_APB2_BUS_PERIPH_BASE_ADDRESS + 0x5400)



/* GPIO Registers Section
 * This section gives a detailed description of the GPIO registers.
 * For a summary of register bits, register address offsets and reset values, see Table 39.
 * The GPIO registers can be accessed by byte (8 bits), half-words (16 bits) or words (32 bits).
 */

/* GPIO port mode register (GPIOx_MODER) (x = A..I/J/K)
 * OFSSET = 0x00 */
#define HAL_GPIO_A_MODER_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x00)
#define HAL_GPIO_B_MODER_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x00)
#define HAL_GPIO_C_MODER_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x00)
#define HAL_GPIO_D_MODER_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x00)
#define HAL_GPIO_E_MODER_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x00)
#define HAL_GPIO_F_MODER_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x00)
#define HAL_GPIO_G_MODER_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x00)
#define HAL_GPIO_H_MODER_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x00)
#define HAL_GPIO_I_MODER_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x00)

/* GPIO port output type register (GPIOx_OTYPER) (x = A..I/J/K)
 * OFFSET = 0x04 */
#define HAL_GPIO_A_OTYPER_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x04)
#define HAL_GPIO_B_OTYPER_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x04)
#define HAL_GPIO_C_OTYPER_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x04)
#define HAL_GPIO_D_OTYPER_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x04)
#define HAL_GPIO_E_OTYPER_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x04)
#define HAL_GPIO_F_OTYPER_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x04)
#define HAL_GPIO_G_OTYPER_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x04)
#define HAL_GPIO_H_OTYPER_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x04)
#define HAL_GPIO_I_OTYPER_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x04)

/* GPIO port output speed register (GPIOx_OSPEEDR) (x = A..I/J/K)
 * OFFSET = 0x08 */
#define HAL_GPIO_A_OSPEEDR_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x08)
#define HAL_GPIO_B_OSPEEDR_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x08)
#define HAL_GPIO_C_OSPEEDR_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x08)
#define HAL_GPIO_D_OSPEEDR_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x08)
#define HAL_GPIO_E_OSPEEDR_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x08)
#define HAL_GPIO_F_OSPEEDR_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x08)
#define HAL_GPIO_G_OSPEEDR_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x08)
#define HAL_GPIO_H_OSPEEDR_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x08)
#define HAL_GPIO_I_OSPEEDR_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x08)

/* GPIO port pull-up/pull-down register (GPIOx_PUPDR) (x = A..I/J/K)
Address offset: 0x0C */
#define HAL_GPIO_A_PUPDR_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x0C)
#define HAL_GPIO_B_PUPDR_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x0C)
#define HAL_GPIO_C_PUPDR_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x0C)
#define HAL_GPIO_D_PUPDR_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x0C)
#define HAL_GPIO_E_PUPDR_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x0C)
#define HAL_GPIO_F_PUPDR_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x0C)
#define HAL_GPIO_G_PUPDR_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x0C)
#define HAL_GPIO_H_PUPDR_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x0C)
#define HAL_GPIO_I_PUPDR_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x0C)

