afatom/arm-cortex-m4-programming/arm/cortex-m4/stm32f407/stm32f4xx_drivers_dev/Inc/hal_stm32f407xx.h
/* GPIO port input data register (GPIOx_IDR) (x = A..I/J/K)
Address offset: 0x10 */
#define HAL_GPIO_A_IDR_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x10)
#define HAL_GPIO_B_IDR_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x10)
#define HAL_GPIO_C_IDR_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x10)
#define HAL_GPIO_D_IDR_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x10)
#define HAL_GPIO_E_IDR_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x10)
#define HAL_GPIO_F_IDR_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x10)
#define HAL_GPIO_G_IDR_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x10)
#define HAL_GPIO_H_IDR_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x10)
#define HAL_GPIO_I_IDR_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x10)

/* GPIO port output data register (GPIOx_ODR) (x = A..I/J/K)
Address offset: 0x14 */
#define HAL_GPIO_A_ODR_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x14)
#define HAL_GPIO_B_ODR_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x14)
#define HAL_GPIO_C_ODR_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x14)
#define HAL_GPIO_D_ODR_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x14)
#define HAL_GPIO_E_ODR_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x14)
#define HAL_GPIO_F_ODR_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x14)
#define HAL_GPIO_G_ODR_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x14)
#define HAL_GPIO_H_ODR_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x14)
#define HAL_GPIO_I_ODR_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x14)

/* GPIO port bit set/reset register (GPIOx_BSRR) (x = A..I/J/K)
Address offset: 0x18 */
#define HAL_GPIO_A_BSRR_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x18)
#define HAL_GPIO_B_BSRR_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x18)
#define HAL_GPIO_C_BSRR_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x18)
#define HAL_GPIO_D_BSRR_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x18)
#define HAL_GPIO_E_BSRR_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x18)
#define HAL_GPIO_F_BSRR_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x18)
#define HAL_GPIO_G_BSRR_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x18)
#define HAL_GPIO_H_BSRR_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x18)
#define HAL_GPIO_I_BSRR_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x18)

/* GPIO port configuration lock register (GPIOx_LCKR)
(x = A..I/J/K)
This register is used to lock the configuration of the port bits when a correct write sequence
is applied to bit 16 (LCKK). The value of bits [15:0] is used to lock the configuration of the
GPIO. During the write sequence, the value of LCKR[15:0] must not change. When the
LOCK sequence has been applied on a port bit, the value of this port bit can no longer be
modified until the next MCU or peripheral reset.
Address offset: 0x1C */
#define HAL_GPIO_A_LCKR_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x1C)
#define HAL_GPIO_B_LCKR_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x1C)
#define HAL_GPIO_C_LCKR_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x1C)
#define HAL_GPIO_D_LCKR_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x1C)
#define HAL_GPIO_E_LCKR_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x1C)
#define HAL_GPIO_F_LCKR_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x1C)
#define HAL_GPIO_G_LCKR_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x1C)
#define HAL_GPIO_H_LCKR_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x1C)
#define HAL_GPIO_I_LCKR_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x1C)

/* GPIO alternate function low register (GPIOx_AFRL) (x = A..I/J/K)
Address offset: 0x20 */
#define HAL_GPIO_A_AFRL_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x20)
#define HAL_GPIO_B_AFRL_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x20)
#define HAL_GPIO_C_AFRL_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x20)
#define HAL_GPIO_D_AFRL_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x20)
#define HAL_GPIO_E_AFRL_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x20)
#define HAL_GPIO_F_AFRL_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x20)
#define HAL_GPIO_G_AFRL_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x20)
#define HAL_GPIO_H_AFRL_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x20)
#define HAL_GPIO_I_AFRL_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x20)

/* GPIO alternate function high register (GPIOx_AFRH) (x = A..I/J/K)
Address offset: 0x24 */
#define HAL_GPIO_A_AFRH_REGISTER              (HAL_GPIO_A_BASE_ADDRESS + 0x24)
#define HAL_GPIO_B_AFRH_REGISTER              (HAL_GPIO_B_BASE_ADDRESS + 0x24)
#define HAL_GPIO_C_AFRH_REGISTER              (HAL_GPIO_C_BASE_ADDRESS + 0x24)
#define HAL_GPIO_D_AFRH_REGISTER              (HAL_GPIO_D_BASE_ADDRESS + 0x24)
#define HAL_GPIO_E_AFRH_REGISTER              (HAL_GPIO_E_BASE_ADDRESS + 0x24)
#define HAL_GPIO_F_AFRH_REGISTER              (HAL_GPIO_F_BASE_ADDRESS + 0x24)
#define HAL_GPIO_G_AFRH_REGISTER              (HAL_GPIO_G_BASE_ADDRESS + 0x24)
#define HAL_GPIO_H_AFRH_REGISTER              (HAL_GPIO_H_BASE_ADDRESS + 0x24)
#define HAL_GPIO_I_AFRH_REGISTER              (HAL_GPIO_I_BASE_ADDRESS + 0x24)


/*SPI control register 1 (SPI_CR1) (not used in I 2 S mode)
Address offset: 0x00*/
#define HAL_SPI_CR1_REGISTER                  (HAL_SPI_1_BASE_ADDRESS + 0x00)
/*SPI control register 2 Address offset: 0x04*/
#define HAL_SPI_CR2_REGISTER                  (HAL_SPI_1_BASE_ADDRESS + 0x04)
/*SPI status register (SPI_SR) Address offset: 0x08*/
#define HAL_SPI_SR_REGISTER                   (HAL_SPI_1_BASE_ADDRESS + 0x08)
/*SPI data register (SPI_DR) Address offset: 0x0C*/
#define HAL_SPI_DR_REGISTER                   (HAL_SPI_1_BASE_ADDRESS + 0x0C)
/*SPI CRC polynomial register (SPI_CRCPR) (not used in I 2 S mode) Address offset: 0x10*/
#define HAL_SPI_CRCPR_REGISTER                (HAL_SPI_1_BASE_ADDRESS + 0x10)
/* SPI RX CRC register (SPI_RXCRCR) (not used in I 2 S mode) Address offset: 0x14 */
#define HAL_SPI_RXCRCR_REGISTER               (HAL_SPI_1_BASE_ADDRESS + 0x14)
/* SPI TX CRC register (SPI_TXCRCR) (not used in I 2 S mode) 0x18*/
#define HAL_SPI_TXCRCR_REGISTER               (HAL_SPI_1_BASE_ADDRESS + 0x18)
/*SPI_I 2 S configuration register (SPI_I2SCFGR) 0x1C*/
#define HAL_SPI_I2SCFGR_REGISTER              (HAL_SPI_1_BASE_ADDRESS + 0x1C)
/*SPI_I 2 S prescaler register (SPI_I2SPR) 0x20*/
#define HAL_SPI_I2SPR_REGISTER                (HAL_SPI_1_BASE_ADDRESS + 0x20)



#define HAL_RCC_BASE_ADDRESS  (HAL_AHB1_BUS_PERIPH_BASE_ADDRESS + 0x3800U)


#define GPIO_AFR_LOW         (0x0)
#define GPIO_AFR_HIGH        (0x1)

#define CLK_ENABLE            ((u8)1)
#define PER_CLK_EN            (CLK_ENABLE)
#define SPI_CLK_EN            (CLK_ENABLE)




/************************************************************************************
*  EXTI Lines IRQ number Deffs
*  see : Table 61. Vector table for STM32F405xx/07xx in RM
*
**************************************************************************************/
//EXTI Line0 interrupt
#define EXTI_LINE_0_IRQ_VECT_POS							(6)
#define EXTI_LINE_1_IRQ_VECT_POS							(7)
#define EXTI_LINE_2_IRQ_VECT_POS							(8)
#define EXTI_LINE_3_IRQ_VECT_POS							(9)
#define EXTI_LINE_4_IRQ_VECT_POS							(10)
#define EXTI_LINE_9_5_IRQ_VECT_POS							(23) //EXTI Line[9:5] interrupts
#define EXTI_LINE_15_10_IRQ_VECT_POS							(40) //EXTI Line[15:10] interrupts


/* IRQ__ For EXTI */
#define IRQ__EXTI_LINE_0_VECT_POS								(6)
#define IRQ__EXTI_LINE_1_VECT_POS								(7)
#define IRQ__EXTI_LINE_2_VECT_POS								(8)
#define IRQ__EXTI_LINE_3_VECT_POS								(9)
#define IRQ__EXTI_LINE_4_VECT_POS								(10)
#define IRQ__EXTI_LINE_9_5_VECT_POS								(23) //EXTI Line[9:5] interrupts
#define IRQ__EXTI_LINE_15_10_VECT_POS							(40) //EXTI Line[15:10] interrupts
/* SPI IRQs */
#define IRQ__SPI_1_GLOBAL_VECT_POS                              (35)  /* SPI1 global interrupt */
#define IRQ__SPI_2_GLOBAL_VECT_POS                              (36)  /* SPI2 global interrupt */
#define IRQ__SPI_3_GLOBAL_VECT_POS                              (51)  /* SPI3 global interrupt */






