afatom/arm-cortex-m4-programming/arm/cortex-m4/stm32f407/stm32f4xx_drivers_dev/Inc/hal_stm32f407xx.h
// IRQ priority levels supported by NVIC
#define NVIC_IRQ_PRIO_0               (0)
#define NVIC_IRQ_PRIO_1               (1)
#define NVIC_IRQ_PRIO_2               (2)
#define NVIC_IRQ_PRIO_3               (3)
#define NVIC_IRQ_PRIO_4               (4)
#define NVIC_IRQ_PRIO_5               (5)
#define NVIC_IRQ_PRIO_6               (6)
#define NVIC_IRQ_PRIO_7               (7)
#define NVIC_IRQ_PRIO_8               (8)
#define NVIC_IRQ_PRIO_9               (9)
#define NVIC_IRQ_PRIO_10              (10)
#define NVIC_IRQ_PRIO_11              (11)
#define NVIC_IRQ_PRIO_12              (12)
#define NVIC_IRQ_PRIO_13              (13)
#define NVIC_IRQ_PRIO_14              (14)
#define NVIC_IRQ_PRIO_15              (15)


/*******************************************************************************************
 *
 *  NVIC Registers
 * *****************************************************************************************/
#define NVIC_BASE_ADDRESS                   (0xE000E100U)
typedef struct {
	volatile U32 ISER_REGTABLE[8];			/* Interrupt Set-enable Registers   */
	volatile U32 RESERVED1[24];				/*----------------------------------*/
	volatile U32 ICER_REGTABLE[8];			/* Interrupt Clear-enable Registers */
	volatile U32 RESERVED2[24];				/*----------------------------------*/
	volatile U32 ISPR_REGTABLE[8];			/* Interrupt Set-pending Registers  */
	volatile U32 RESERVED3[24];				/*----------------------------------*/
	volatile U32 ICPR_REGTABLE[8];			/* Interrupt Clear-pending Registers */
	volatile U32 RESERVED4[24];				/*----------------------------------*/
	volatile U32 IABR_REGTABLE[8];			/* Interrupt Active Bit Registers */
	volatile U32 RESERVED5[56];				/*----------------------------------*/
	volatile U32 IPR_REGTABLE[60];			/* Interrupt Priority Registers */
	volatile U32 RESERVED6[644];
	volatile U32 STIR;						/* Software Trigger Interrupt Register */
}NVIC_RegDef_t;


#define NVIC                	((NVIC_RegDef_t*)(NVIC_BASE_ADDRESS))

#define pNVIC_ISER0_REG         ((volatile U32*)(0xE000E100))
#define pNVIC_ISER1_REG         ((volatile U32*)(0xE000E104))
#define pNVIC_ISER2_REG         ((volatile U32*)(0xE000E108))
#define pNVIC_ISER3_REG         ((volatile U32*)(0xE000E10C))


#define pNVIC_ICER0_REG         ((volatile U32*)(0XE000E180))
#define pNVIC_ICER1_REG         ((volatile U32*)(0XE000E184))
#define pNVIC_ICER2_REG         ((volatile U32*)(0XE000E188))
#define pNVIC_ICER3_REG         ((volatile U32*)(0XE000E18C))

#define pNVIC_IPR0_REG          ((volatile U32*)(0xE000E400))

#define pNVIC_IPR1_REG          ((volatile U32*)(0xE000E400U + 0x04))



#endif /* INC_HAL_STM32F407XX_H_ */
